dag_logs/execution_dag_20250707_160949.dot
digraph ExecutionDAG {
    rankdir=TB;
    node [shape=box, style=rounded];
    "BOOTSTRAP" [label="BOOTSTRA...\nSYSTEM", fillcolor=lavender, style="rounded,filled"];
    "sentinel_instance_01" [label="sentinel...\nCOMPONENT", fillcolor=pink, style="rounded,filled"];
    "quantifier_agent_primary" [label="quantifi...\nCOMPONENT", fillcolor=pink, style="rounded,filled"];
    "SEED_EXEC_test_iter1" [label="SEED_EXE...\nSEED_EXECUTION", fillcolor=khaki, style="rounded,filled"];
    "df3d106a-4713-4707-bf1d-840a3f8e3f99" [label="df3d106a...\nSEED_IDEA", fillcolor=lightgreen, style="rounded,filled"];
    "e9e919d3-6f71-4408-9933-52563543d3fe" [label="e9e919d3...\nGENERATED_IDEA\nTitle: "The Mystery of the Lob...", fillcolor=lightblue, style="rounded,filled"];
    "e3058b9d-e38e-4ed1-9856-49bca3eda39b" [label="e3058b9d...\nGENERATED_IDEA\nImagine a small coastal town w...", fillcolor=lightblue, style="rounded,filled"];
    "cc658fc8-8540-45ec-a060-2efa44a23c79" [label="cc658fc8...\nGENERATED_IDEA\nTitle: "The Lobster's Great Es...", fillcolor=lightblue, style="rounded,filled"];
    "df3d106a-4713-4707-bf1d-840a3f8e3f99" -> "e9e919d3-6f71-4408-9933-52563543d3fe" [label="GENERATES\ndepth=0"];
    "df3d106a-4713-4707-bf1d-840a3f8e3f99" -> "e3058b9d-e38e-4ed1-9856-49bca3eda39b" [label="GENERATES\ndepth=0"];
    "df3d106a-4713-4707-bf1d-840a3f8e3f99" -> "cc658fc8-8540-45ec-a060-2efa44a23c79" [label="GENERATES\ndepth=0"];
}
